{
	"title": "Dracula",
	"description": "A supernatural CYOA for r/CelebEconomy by u/spanchob",
	"data": [
		{
			"type": "paragraph",
			"title": "Introduction",
			"description": [
				"You are a recent high school graduate, back home from college for vacations. You were at the bar having a drink and enjoying yourself when you meet a girl and your life changed completely"
			]
		},
		{
			"type": "choice",
			"title": "Companion",
			"description": "You were at a bar when you first met her. That night after a good pounding she bit you and gave you the powers of count dracula. Now she serves as your loyal companion and maintains your harem. In exchange for her loyalty, you fuck her hard every night leading to ground-breaking orgasms for you both. You often even find her dominating and fucking other members when you aren't.",
			"choices": [
				{
					"name": "Emma Watson",
					"image": "EmmaWatson.jpg",
					"modifier": "+2 Composure +3 Tension",
					"perk": "",
					"description": "At first you thought Emma was a prude, however later you found out that she is a dedicated slut to only her master. She doubted you could get her off when you first met, now she has to ask you to be gentle as you ravage her slender body. \"MASTER YOU'RE BREAKING ME IN HALF!\" she moans often when you roughly pound her holes."
				},
				{
					"name": "Selena Gomez",
					"image": "SelenaGomez.jpg",
					"modifier": "+2 Lust +3 Tension",
					"perk": "",
					"description": "Selena's previous master had vanilla tastes. As such, Selena didn't know about different sex techniques. Luckily for you, she is a passionate learner and you have managed to teach her everything from face-fucking throatpies to raw blissful anal penetration. The way she moans your name whenever you fuck her using a new technique is to die for."
				},
				{
					"name": "Anna Kendrick",
					"image": "AnnaKendrick.jpg",
					"modifier": "+2 Intellect +3 Tension",
					"perk": "",
					"description": "Anna is a complete klutz. She would often drop things she is holding, breaking many items of importance. In order to apologise for her mistakes, she gives you amazing blowjobs that make you horny enough to fuck her as she submissively moans \"BREED ME DADDY! RELEASE YOUR SEED INSIDE ME!\". Sometimes you think she breaks things on purpose"
				}
			]
		},
		{
			"type": "paragraph",
			"title": "The Rules",
			"description": [
				"The next day you woke up in your bed with your companion naked on your bed. When you wake up she kisses you and explains the rules once you're completely awake. She informs you that she bit you and converted you into the latest reincarnation of Count Dracula of Wallachia. With your new roles you get a few new powers. Most importantly you can control anyone's mind indefinately by biting them once.",
				"Converting someone this way lets you control them but also increases your TENSION which can be detrimental if it gets too high. Additionally you also gain COMPOSURE, LUST and INTELLECT for every woman you convert. You laugh a bit realising that the stats spell out CLIT. After giving this explaination, your companion takes off your pants and starts stroking your cock before putting it inside her pussy and taking care of your morning wood by letting you cum inside her.",
				"TL;DR: Keep COMPOSURE, LUST and INTELLECT high while keeping TENSION low."
			]
		},
		{
			"type": "choice",
			"title": "Step Mother",
			"description": "You had seduced your stepmother shortly after your father left her, and used to fuck her regularly before becoming a vampire. She was the first member of your vampire harem and the first person you had converted. Now you often find her in doing chores in the house, during which you fuck her free-use. She enjoys getting ravaged by her former stepson as she is working in the house.",
			"choices": [
				{
					"name": "Rose Byrne",
					"image": "RoseByrne.jpg",
					"modifier": "+2 Composure +2 Tension",
					"perk": "",
					"description": "Rose was a lovely woman who loved you and your father. After your father left, you corrupted her and made her give in to her lust. Now she is a cum-hungry whore, but only for you. You love fucking the MILF's pussy as she moans your name so loud that the neighbhors can hear while cumming all over your cock. Cumming in her pussy and making her a \"slut mother\" as she likes to call herself is one of your favourite activities."
				},
				{
					"name": "Rachael McAdams",
					"image": "RachelMcAdams.jpg",
					"modifier": "+2 Lust +1 Tension",
					"perk": "Perk: Mean Girls",
					"description": "Rachel was a slut through and through. When your father left she had to find other means to fulfil her carnal needs. Seeing this you seduced her and within no time you were fucking her every night. At breakfast she would often give you heavenly blowjobs under the table as you left for university. Coming back to home, you would return the favour by pounding her as you pulled her hair and made her scream with pleasure."
				},
				{
					"name": "Zooey Deschanel",
					"image": "ZooeyDeschanel.jpg",
					"modifier": "+2 Intellect -1 Tension",
					"perk": "",
					"description": "Zooey seemed like a innocent girl on the outside however, in the bedroom she is a cum chugging monster. You seduced her after you found her masterbating alone since your father had left. She gived you amazing blowjobs instead of letting you masterbate. Her doe-like eyes look up at you submissively while she sucks on your cock like a whore. Titfucks, missionary and any position where you can see her face as she moans are blissful."
				}
			]
		},
		{
			"type": "choice",
			"title": "Step Sister",
			"description": "Your Step Sister was hot, like really hot. You had fantasised about her many times until one day the oppurtunity revealed itself and you took her virginity. After converting her, she now serves as a maid at your castle, assisting your step-mother with daily chores. You asked her to do her duties while being naked and she obliged. Every now and then you take her to your room and plow her senseless as she moans about how she loves her step-brother fucking her. You also love seeing her masterbate by herself thinking about you.",
			"choices": [
				{
					"name": "Joey King",
					"image": "JoeyKing.jpg",
					"modifier": "+2 Composure +2 Tension",
					"perk": "Perk: Kissing Booth",
					"description": "Joey was one of the most popular girls in her grade. She had broken up with many boyfriends when they found out she was a virgin. Sick and tired of getting her heart broken, she decided to lose her virginity to you. You and her had many steamy affairs, and she would often even set you up with some of her hot friends. You enjoyed ripping her short clothes off and exploiting her pussy mercilessly as she gets off from the thrill of cheating on her boyfriend."
				},
				{
					"name": "Lauren Summer",
					"image": "LaurenSummer.jpg",
					"modifier": "+2 Lust +1 Tension",
					"perk": "",
					"description": "One day while browsing the internet you found Lauren's OnlyFans. When you confronted her about it, she begged you not to tell her mom about it. Taking advantage of the situation, you decided to negotiate a deal with her. In exchange for your silence she would have to be your submissive slut for 1 hour every day. At first she hesitated but after she saw your cock, it was hard to rid of her whenever your parents werent around. You also recorded videos of you fucking her for her Onlyfans"
				},
				{
					"name": "Katherine Langford",
					"image": "KatherineLangford.jpg",
					"modifier": "+2 Intellect -1 Tension",
					"perk": "",
					"description": "You would often jerk off to Katherine while peeping her showering or taking a bath. Your doubts about her spotting you got confirmed when after her 18th birthday she asked you to join her. You took her virginity that day in the shower. What followed was a daily facefucks and creampies at home, in school, at the local pool, etc. Basically if there was any place where you could fuck, you would and the thrill of getting caught made it all the more fun. You especially enjoy her titjobs and deepthroat facefucks"
				}
			]
		},
		{
			"type": "choice",
			"title": "Step Aunt",
			"description": "You and your step aunt were really close. She taught you a lot about sex, in fact she was the first woman you fucked. Every summer she would come visit your family and you would have a fuck filled summer. When your step-mom found you and her having sex, you convinced her to join in with you guys for a hot stepfamily threesome. You converted her one summer and now she serves you as your step-mother's assistant in day to day tasks. You fuck her from behind while she cooks food. Her moans as you manhandle her boobs while plowing her are divine.",
			"choices": [
				{
					"name": "Jenna Coleman",
					"image": "JennaColeman.jpg",
					"modifier": "+2 Composure -1 Tension",
					"perk": "",
					"description": "Jenna was a quite lady. Despite being extremely attractive, she couldnt seem to stay with anyone. When she found you masterbating one day, she came in from behind and started jerking you off. You then turned her around and started groping her through her blouse, which turned her on. \"I want you to make my legs feel sore tomorrow nephew!\" She said while you were sucking her tits. Needless to say you fulfiled her wish. You love fucking Jenna in missionary as she looks at you innocently with her eyes and moans"
				},
				{
					"name": "Chloe Grace Moertz",
					"image": "ChloeGraceMoretz.jpg",
					"modifier": "+1 Lust +2 Tension",
					"perk": "",
					"description": "Chloe was much younger than her sister. One day you caught her jilling off to step-daddy porn. The next day, you went into her room, took out your cock and asked her \"Who's your daddy?\" Immediately she get onto her knees and started blowing you with her DSLs. You then started dominating her, tearing her clothes and choking her while you plowed her ass from behind while pulling her hair. She really enjoyed getting plowed by you and kept calling you daddy as you filled her holes with your semen for being a naughty daughter."
				},
				{
					"name": "Elizabeth Olsen",
					"image": "ElizabethOlsen.jpg",
					"modifier": "+1 Intellect +1 Tension",
					"perk": "Civil War",
					"description": "Elizabeth was older than your stepmother, however she was much more innocent. When her husband died, she started living with your family. One night, you entered her bedroom while she was asleep and started groping her. To your surprise she was into it and started jerking you off. When she found out it was you that was groping her she was surprised but let you fuck and cum inside her. Slowly and steadily you corrupted her and made her enjoy sex. You love fucking her in missionary as you kiss her neck and boobs."
				}
			]
		},
		{
			"type": "choice",
			"title": "Neighbhor",
			"description": "Your MILF neighbhor was a single mother. When she found out about you fucking your family, she confronted you about it, but rather than tell on you, she wanted to fuck you too. After a long night filled with numerous creampies, she gave you a key to her house and gave you an open invitation to come in anytime and have some fun. You converted her and now she raises your step-sister and her daughter, fucking them both whenever need be. You enjoy playing with her boobs and kissing her in missionary as she moans about how you're better than her husband.",
			"choices": [
				{
					"name": "Natalie Portman",
					"image": "NataliePortman.jpg",
					"modifier": "+1 Composure +1 Tension",
					"perk": "",
					"description": "Natalie was submissive to a fault. After her husband \"master\" died, she has been looking for a new person who she should worship. Luckily for you, she found you. Whenever she is in your presence, she gets down on all fours and asks to be spanked and manhandled. You love bending her over, spanking her and pulling her hair while anally annihilating her. She loves to take your cum in her pussy, calling herself your cumbucket and fuckpet. Ordering her around and ripping her clothes off is just as fun as getting a sensual titjob from her."
				},
				{
					"name": "Diane Kruger",
					"image": "DianeKruger.jpg",
					"modifier": "+2 Lust +1 Tension",
					"perk": "",
					"description": "Diane was the former mayor of the town. She was a proper lady, which is why you were surprised when she invited you to dinner at her place and flashed you her pussy. She wanted to get fucked by a big dick and you fulfiled her request. Now you fuck her regularly at her house. She puts on classy outfits before inviting you for fun, which you love peeling off her slim and busty body. You love seeing her moan your name as you exploit her pussy and slap her tits. She wants you to finish inside her as the warmth of your semen brings her joy."
				},
				{
					"name": "Jessica Chastain",
					"image": "JessicaChastain2.jpg",
					"modifier": "+1 Intellect +2 Tension",
					"perk": "",
					"description": "Jessica was the MILF that all the boys in the neighbhorhood had a crush on. One day when your family was away, she invited you to her house and went skinny dipping in her pool. When you found her you gave her a towel and groped her body. To your surprise she like it and asked you for more. Obviously you obliged and fucked the redhead's pussy hard. She then wanted you to fuck her ass, which you did while pulling on her hair and kissing her neck. She now lets you come into her house at anytime to fuck her and even sends you daily nudes."
				}
			]
		},
		{
			"type": "choice",
			"title": "Neighbhor's Daughter",
			"description": "Your Neighbhors daughter was about the same age as your step-sister. Similar to your step-sister, you took her virginity too. She would often call you daddy, since you were also fucking her mother. After converting her you convinced her to start an OnlyFans alongside your step-sister where you would click and post lewd and nude pictures of them fucking each other. They agreed as long as they recieved your cum in weekly threesomes, which you were absolutely fine with. She now has a large following on OnlyFans and brings in a lot of income for the harem.",
			"choices": [
				{
					"name": "Natalia Dyer",
					"image": "NataliaDyer.jpg",
					"modifier": "+1 Composure -1 Tension",
					"perk": "",
					"description": "Natalia was shy and didn't talk much. Rumors that she had a massive crush on you were confirmed when one day you caught her masterbating while peeping and seeing you fucking her mom. After a while she left and continued in her room. After finishing with her mom, you entering her room and gave her what she desperately wanted, taking her virginity and making her a woman. After that you fucked her often and also sent her recordings of you fucking other women. The way she moans your name and lovingly called you daddy makes you cum just by thinking about it."
				},
				{
					"name": "Elle Fanning",
					"image": "ElleFanning.jpg",
					"modifier": "+1 Lust +1 Tension",
					"perk": "",
					"description": "Elle was a very lively and outgoing girl. One day, she saw you having sex with your step-sister at home, which made her horny. The next day she invited you to her house for dinner, while wearing a skimpy schoolgirl outfit. She then invited you to her room and asked you to treat her like your stepsister. You ripped her clothes off and fucked her pussy hard. Afterwards she would often go out with you to all sorts of places, just to fucked publically as your sister. You enjoy the way her legs grab you and bring you close to her body when you are fucking her."
				},
				{
					"name": "Tiffany Alvord",
					"image": "TiffanyAlvord.jpg",
					"modifier": "+2 Intellect -1 Tension",
					"perk": "",
					"description": "Tiffany was a popular local musician. After she broke up with her boyfriend you found her on your doorstep. After you comforted her, she told you how she would swallow her ex's cum to make her voice melodius. Being the nice guy you are, you offered her your cum. She started sucking your cock but it wasnt enough to make you nut, so you grabbed her body, bent her over and fucked her. While it was her first time, she seemed to enjoy it and you gave her a throatpie. Afterwards you had to give her regular throatpies to help her voice, a deal you both liked a lot."
				}
			]
		},
		{
			"type": "choice",
			"title": "Cheerleader",
			"description": "The cheerleader was the hottest girl when you were in school. You obviously had a massive crush on her, but nothing came of it. When you met her at a football game, cheering for her team, you felt a lustful urge. After the game, you took her to a corner and converted her. Now she serves the harem by taking up small acting jobs here and there. She is more than willing to roleplay anything in bed, from locker room fantasies to mild rapeplay. You love how her makeup flows down her face after you facefuck her on the set of her latest movie.",
			"choices": [
				{
					"name": "Camila Mendes",
					"image": "CamilaMendes.jpg",
					"modifier": "+2 Composure +2 Tension",
					"perk": "",
					"description": "Camila was rich and spoilt. After you converted her, you had to give her many facefucks and anal creampies to make her learn her place in the harem and destroy her massive ego. Soon however, you broke her ego and finally she became subservient to you. You however, grew overly fond of punishing her and as such you only fuck her roughly regardless of her pleas. The way she looks at you when you blow a load inside her ass from behind is a sight to behold. She often calls herself your \"Spoilt Rich Fuckpet\" when you fuck her roughly."
				},
				{
					"name": "Lili Reinhart",
					"image": "LiliReinhart.jpg",
					"modifier": "+1 Lust -1 Tension",
					"perk": "",
					"description": "Lili and you were good friends in middle school, however when you entered high school you grew apart. After converting her, she admitted that she always wanted to get fucked by you, but thought you had lost interest in her. You obliged her request, ripped her cheerleader uniform off her body and fucked her hard in missionary. She really enjoyed it and talked about how she had never had someone so deep inside her. You love fucking her in all sorts of loving positions while kissing her slim tender body as she moans about how deep your dick is inside her."
				},
				{
					"name": "Madelaine Petsch",
					"image": "MadelainePetsch.jpg",
					"modifier": "+1 Intellect +2 Tension",
					"perk": "",
					"description": "Madelaine was a bully. When you joined high school, she humiliated you in front of the school, threw you stuff in the trash and all the other things that bullies do. Once you converted her, it was time to repay the favour. You fucked her, right there in the corner where you converted her, pulling her arm behind her back and pushing her into the wall. Afterwards, you took her to your house and now you enjoy hatefucking her and making her want to cum for hours but not letting her. You love fucking her anally in pronebone as she apologises for her actions."
				}
			]
		},
		{
			"type": "paragraph",
			"title": "The Great Move",
			"description": [
				"After you had assembled a decent harem at your home, your Companion informed you of a mansion in Transylvania that belongs to you as the current reincarnation of count dracula. The mansion would greatly improve your tension tolerance and the additional bedrooms will allow you to unify your harem. You obviously decided to move and took all the members in your harem with you. The additional room in your new residence made you want to get more members to join your harem and your improved powers in the mansion made sex all the more pleasureable with all your harem members."
			]
		},
		{
			"type": "choice",
			"title": "Models",
			"description": "As the owner of a large property in your area, you were invited to visit a fashion show that was happening in your city. Since you had nothing better to do and wanted to see (and recruit) some busty chicks, you decided to go. At the fashion show, you snuck in backstage and saw all the models as they changed from one skimpy outfit to another. Filled with lust and horniness, you decided to covert a few of them right there and bring them into your harem. (Take as many as you want but you must recruit at least one)",
			"choices": [
				{
					"name": "Miranda Kerr",
					"image": "MirandaKerr.jpg",
					"modifier": "+2 Tension",
					"perk": "",
					"description": "Kink: Passionate Kissing and Tit Groping"
				},
				{
					"name": "Kate Upton",
					"image": "KateUpton.jpg",
					"modifier": "+2 Tension",
					"perk": "",
					"description": "Kink: Sloppy Titfucks and Powerful Spanking"
				},
				{
					"name": "Alejandra Guilmant",
					"image": "AlejandraGuilmant.jpg",
					"modifier": "+2 Tension",
					"perk": "",
					"description": "Kink: Step-Daughter Roleplay and Passionate Missionary"
				},
				{
					"name": "Nicola Cavanis",
					"image": "NicolaCavanis.jpg",
					"modifier": "+2 Tension",
					"perk": "",
					"description": "Kink: Getting Manhandled and Submissive Pronebone"
				},
				{
					"name": "Sabrina Lynn",
					"image": "SabrinaLynn.jpg",
					"modifier": "+2 Tension",
					"perk": "",
					"description": "Kink: Brutal Facefucks and Unlubed Anal"
				},
				{
					"name": "Barbara Palvin",
					"image": "BarbaraPalvin.jpg",
					"modifier": "+2 Tension",
					"perk": "",
					"description": "Kink: Public Sex and Standing Pussyfucks"
				}
			]
		},
		{
			"type": "choice",
			"title": "Whore",
			"description": "Seeing how high your tension has gotten, your companion suggested buying a whore from the local brothel and converting her into your sex slave, to use as you please and relieve tension. You obviously loved the idea and went to the brothel at once and bought a whore. When you brought her home, you made her give you a striptease and when she was completely naked, bit her on her tits, converting her into a vampire. Now she serves as your stress relief fucktoy, who you abuse and exploit wholeheartedly.",
			"choices": [
				{
					"name": "Elizabeth Turner",
					"image": "ElizabethTurner.jpg",
					"modifier": "+1 Composure -2 Tension",
					"perk": "",
					"description": "Elizabeth was a refugee from a foreign country, who came to Romania after being promised work. Little did she know that once she got here she would be sold to a brothel to work as a whore. Nevertheless, she worked hard to satisfy her customers and earn money. When you fuck her you can tell that she can endure anything, which encourages you to just fuck her harder. No matter what you try on her, BDSM, spanking and god knows what else, she just endures it, smiles and moans with pleasure while cumming."
				},
				{
					"name": "Sydney Sweeny",
					"image": "SydneySweeny.jpg",
					"modifier": "+1 Lust -3 Tension",
					"perk": "",
					"description": "Sydney was a cheerleader in high school, however when her parents died after she graduated, she became a whore to earn enough money to live. She clearly has daddy issues, since her father was distant and abusive. You love making her cum as she moans \"Thank you daddy!\" in pleasure. You often have threesomes with her and the cheerleader, both of them pretending to be cheerleaders and you their coach who has to decide which one of them becomes a part of the cheer team."
				},
				{
					"name": "Emma Stone",
					"image": "EmmaStone.jpg",
					"modifier": "+2 Intellect -2 Tension",
					"perk": "",
					"description": "Not only did Emma have a high school diploma, she was a college graduate. Being extremely intelligent and hot, Emma was a whore by choice rather than by necessity. She wanted to explore her sexuality while also getting to know people's deepest darkest secrets. She seductively tells you about the sex lives of historical figures, before roleplaying as their concubines and fucking you. You give her all sorts of historical costumes and dresses, only to rip them off when you fuck her in cosplay."
				}
			]
		},
		{
			"type": "choice",
			"title": "Tourist",
			"description": "One day while it was raining at night, a tourist knocked on your door. When you opened the door you found a hot woman, drenched in the rain, looking for a place to stay for the night. You obviously let her in and gave her a room. At midnight, you entered her room as she was sleeping. She got up and quickly understood that this was how you wanted payment for the room. She then took off her clothes and got on all fours asking to be fucked. You converted her and now have her serve as a bathing assistant for the harem.",
			"choices": [
				{
					"name": "Nina Dobrev",
					"image": "NinaDobrev.jpg",
					"modifier": "+2 Composure +1 Tension",
					"perk": "The Vampire Diaries",
					"description": "Nina was a professional swimmer from the UK, here on a solo trip. She was used to swimming naked as it made her more aerodynamic. You often join her naked in the pool and finger her while playing with her tits. In exchange she jerks you off and fondles your balls. Afterwards you dry her off with a towel, touching all parts of her succulent body, before going to the bedroom and having mind blowing post swimming sex."
				},
				{
					"name": "Amanda Cerny",
					"image": "AmandaCerny.jpg",
					"modifier": "+1 Lust +1 Tension",
					"perk": "",
					"description": "Amanda had come to Romania from the United States and had joined a nudist cult, before running away. When she came to your doorstep she was naked and didn't have any clothes. After you converted her, you decided to have her retain her nudist ways and not provide her any clothes. You often find her roaming the corridors which gives you a hard boner. You then usually proceed to grope and kiss her, before emptying your balls inside her juicy pussy."
				},
				{
					"name": "Katie McGrath",
					"image": "KatieMcGrath.jpg",
					"modifier": "+1 Intellect +1 Tension",
					"perk": "",
					"description": "Katie was a geography researcher from Ireland. She was in Romania to put her mind to research after her boyfriend broke up with her because she wouldn't have sex with him. Seeing as to how her lack of libido hurt her previous relationship, she is now almost always horny around you, thinking that will preserve this relationship. You obviously dont mind fucking this Irish slut non-stop as she moans your name in a hot Irish accent."
				}
			]
		},
		{
			"type": "choice",
			"title": "Maid",
			"description": "With the new influx of members your mansion gets dirty very fast, so you decide to hire a maid. She is also a part of the harem and freeuse for anyone in the harem. She cleans the house, does the dishes and even cleans your cum filled laundry and bedsheets, stopping only when you bend her over, rip off her maid uniform and insert your rock hard vampire cock into her pussy as she moans \"I'm Sorry Sir! I'll make sure to clean better next time!\". She also joins you and your harem for threesomes whenever you want her to.",
			"choices": [
				{
					"name": "Lily James",
					"image": "LilyJames.jpg",
					"modifier": "+1 Composure -1 Tension",
					"perk": "",
					"description": "Lily was a meek little girl. Her father had abandoned her at a very young age so she obviously had some daddy issues, a fact that you enjoyed a lot. You would often ask her to clean your room, only to have her come in and be punished by you. You throw her on the bed, take out your cock and insert into her small frame, knowing full well that she won't be able to take all of it. Her moans while having her pussy stretched and penetrated are utterly divine and make you cum inside her faster than any other harem member."
				},
				{
					"name": "Jia Lissa",
					"image": "JiaLissa.jpg",
					"modifier": "+2 Lust -1 Tension",
					"perk": "",
					"description": "Jia was a former pornstar. You hired her after her porn career crashed and burned. You have her dress up in all sorts of kinky outfits, from school uniforms to swimsuits, while she cleans the house. You often find other harem members groping and kissing her, which almost always turns you on. You decide to stop these actions at once by intervening and providing the other member with a strap-on so that you may both fuck Jia in double penetration to remind her who owns her. She actually enjoys these sessions and often asks you to fuck her with your companion."
				},
				{
					"name": "Kristen Stewart",
					"image": "KristenStewart.jpg",
					"modifier": "+1 Intellect -2 Tension",
					"perk": "Twilight",
					"description": "Kristen was a college student who worked part-time as a maid. After you converted her, she dropped out from college and started serving you full time. In exchange for her sacrifice, you let her decide when you fuck her, rather than the other way around. While it is a bit annoying when you are horny but can't fuck her, whenever you do get to do it with her its all the more amazing. Whenever you fuck her, you go in from behind, pull her hair and choke her while whispering in her ear all the times you wanted to fuck her but couldn't."
				}
			]
		},
		{
			"type": "choice",
			"title": "Government Worker",
			"description": "After a while, the government started getting suspicious of your activities in the mansion, so they sent someone to check the place out. Luckily your companion figured out who they were sending beforehand and you converted her and made her join your harem. Now with someone on the inside of the government, you were no longer afraid of the government pursuing anything against you. Luckily for you this woman was also a fiesty one and a master of seduction, so her inclusion in the harem also gave you another worthy fucktoy to play with.",
			"choices": [
				{
					"name": "Katherine McNamara",
					"image": "KatherineMcNamara2.jpg",
					"modifier": "+1 Composure -1 Tension",
					"perk": "Shadowhunters",
					"description": "Katherine was a spy for the CIA, and as such she was well versed in seduction techniques and foreplay. However oddly enough she wasn't too experienced in sex, since she would extract the information she needed before getting penetrated. You decided to combine your knowledge of sex, with her seduction techniques to make her the ultimate fucking machine. She would often seduce you with her charm and skimpy but classy dresses and then in the bedroom become a submissive pet, who you would fuck in pronebone while agressively yanking her hair, reminding her who she worked for."
				},
				{
					"name": "Felicity Jones",
					"image": "FelicityJones.jpg",
					"modifier": "+2 Lust -2 Tension",
					"perk": "",
					"description": "Felicity was an assassin for MI6. She was made to undergo extreme endurance and flexibility training, all of which helped in the bedroom. She was also good at getting fucked, since she would often need to have animalistic sex with criminals while undercover. You would often remind her of those criminals by fucking her pussy as hard you could and making her moan so loud that the entire neighbhorhood could hear. You loved fucking her in doggystyle as she pretended to be a bimbo and you yanked her her and face while slapping her ass and boobs as she moaned to dear god for her life."
				},
				{
					"name": "Sophie Turner",
					"image": "SophieTurner.jpg",
					"modifier": "+1 Intellect -1 Tension",
					"perk": "",
					"description": "Sophie, or as her name really should be Princess Sophie III of Carpathia, was a member of the Romanian royal family. She had come to investigate your house after she found out that you would pleasure women like no one else in Romania. She was sexually frusterated and as a member of the royal family she had to maintain her purity. Luckily once you converted her you were able to have her get fucked without harming her hymen, a fact which she thanks you for by letting you fuck her in the palace. While fucking in the palace you often also invite your companion over for a threesome."
				}
			]
		},
		{
			"type": "choice",
			"title": "Doctor",
			"description": "When one of your harem members fell sick, your companion suggested converting a doctor to help cure her. You immediately went to the local medical college and converted a soon-to-be doctor. Once you brought her home she treated the harem member. After a while, she came up to you with an idea. She told you that she had invented a machine that could allow you to spread your vampire conversion enzymes throughout the world through a virus, however she needed some time to build the machine. Needless to say you gave her the go ahead for the idea and rewarded her by fucking her passionately that night.",
			"choices": [
				{
					"name": "Margaret Qualley",
					"image": "MargaretQualley.jpg",
					"modifier": "+1 Composure +2 Tension",
					"perk": "",
					"description": "Margaret was a brilliant doctor who had done multiple surgeries before even graduating medical school. As such, she knew the anatomy of the human body very very well, a fact which she used to give you mind-numbing orgasms when she rode you, without having you cum. She was also very meek though and as such when you decided to go against her suggestions she wouldn't push too hard and would let you have her way with her. You loved fucking her in missionary as she squirted all over the bed thanking you for the orgasm. When you would cum inside her she would use her fingers and somehow get it all out."
				},
				{
					"name": "Olivia Wilde",
					"image": "OliviaWilde.jpg",
					"modifier": "+1 Lust +3 Tension",
					"perk": "",
					"description": "Olivia was a slut through and through. She got through medical school by sleeping with professors and giving students blowjobs for assignments. While at first you throught she wouldn't know much about medicine, she actually surprised you, explaining that she only slept with the professors because it was easier than memorising medical theory. Even so, sometimes she even surprises you with her sexual knowledge as she asks you to fuck her in new positions while roleplaying as her professor. \"YES PROFESSOR!\" is a phrase she often moans when you use your huge vampire dick to annihilate her pussy."
				},
				{
					"name": "Zoey Deutch",
					"image": "ZoeyDeutch2.jpg",
					"modifier": "+2 Intellect +2 Tension",
					"perk": "",
					"description": "Zoey's parents were both scientists, so she was practically raised to be a doctor. As such, she never really had time to have sex with people. Luckily, once you converted her, you were able to solve this issue. She loves observing you fucking other women and as such she often peeps at you having sex with other harem members. You love fucking her soft, plushy body from behind as her boobs bounce around and she moans \"Thank you sir for using me!\". She asks you to join her for weekly checkups, which almost always end with you releasing buckets of cum inside her as she moans loudly at each downstroke into her."
				}
			]
		},
		{
			"type": "choice",
			"title": "Detective",
			"description": "Despite your best efforts, your harem is being investigated by the local detective. She is a hot chick who (if rumors are to be believed) is still a virgin. You check with your doctor to see when the machine would be built, who tells you that it will be done by tomorrow. As such you decide to surrender yourself to the detective, instructing your harem to attack the location where she takes you for holding. When you reach the police station, you ask the detective to arrest you, before kissing her. She instantly moves away but you can clearly see the lust in her eyes.",
			"choices": [
				{
					"name": "Chloe Bennet",
					"image": "ChloeBennet.jpg",
					"modifier": "-2 Composure +3 Tension",
					"perk": "",
					"description": "Chloe was a cheerful but strict police officer. Her father was also a police officer who most boys were scared of. As such she never got to have sex in high school or college. Once she left college, she joined the police force which again scared most men. Regardless of her inexperience, she does have a very good and busty body. You can't wait to fuck her ass in pronebone as she moans about how much it hurts, while pulling her hair and slapping her face. Cumming inside her ass would be divine, but for now you must wait till your harem arrives to rescue you."
				},
				{
					"name": "Kathryn Winnick",
					"image": "KathrynWInnick.jpg",
					"modifier": "-2 Lust +3 Tension",
					"perk": "",
					"description": "Kathryn was raised in an all-girls school. As such she only got the chance to encounted lesbian girls playing with each other. While she knew she liked boys, seeing lesbians fuck each other and moan in pleasure awoke something inside her and she realised she was bisexual. However, dispite this, she was unable to find anyone who would want to have sex with her due to her bad social skills. You hope to change all that by having a threesome with her and your companion, having her lick your companions pussy while you insert your monster cock inside her and make her cum."
				},
				{
					"name": "Melissa Benoist",
					"image": "MelissaBenoist.jpg",
					"modifier": "-2 Intellect +3 Tension",
					"perk": "",
					"description": "Melissa was raised by nuns in a catholic convent. She was told from the very beginning that she should remain a virgin till marriage. When you kissed her she slapped you and said that god will judge you for your sins. Oddly enough, imagining her quoting the bible during sex really turned you on and your couldnt wait to rail her along a stairway as she moaned for forgiveness from god. You also really got turned on when she obliviously started sucking a banana as if she was getting facefucked by it, imaging how she would look at you if that were your dick inside her face."
				}
			]
		},
		{
			"type": "paragraph",
			"title": "Ending",
			"description": [
				"After you turned yourself in and you were with the police, your harem, led by your companion, rushed in to rescue you. They started converting all the police officers into vampires and eventually reached the interrogation room where you were held with the detective. The detective, unaware of what was going on outside kept questioning you, increasing your tension slowly but steadily.",
				"(If your tension was above 10) As your harem is about to enter, your tension goes above what you can handle. You can feel losing control over all your harem members until suddenly you feel a snap and you lose all control of your harema and fall into a coma. When you wake up you are in your hometown with your step-family and neighbhors. You see a note from your companion informing you that since you were unable to cope with the pressures of being a count, you have been stripped of your powers. You still have your pre-existing harem of step-family and neighbhors but to thing what you couldve had if only you had been less greedy...",
				"(If your tension was below 10) Your harem enters the room and captures the detective. Your companion informs you that the doctor has managed to complete the machine and will activate it whenever you command. Before you activate the machine there is only one thing you have left to do. You grab the detective and throw her on top of the interrogation table, rip her clothes off her body and look at her lustfully. \"Do what you're gonna do. At least I wont die a virgin.\" she sighs. Seeing her approval you insert your vampire cock into her as she lets out a loud moan. You fuck her agressively shaking the table and the whole room as your harem masterbated to your agressive rough sex. She moans \"YES MASTER FUCK YOUR LITTLE SLUT!\" as you choke her and bring her face close to yours for some passionate kissing. You cum inside her leaving her asking for more as her entire body quivers from the rough fucking. After taking her virginity, you give the go ahead for the doctor to release the weaponised vampire virus."
			]
		},
		{
			"type": "choice",
			"title": "World Conquest",
			"description": "(ONLY UNLOCKED IF TENSION WAS BELOW 10) (Add up your Composure, Lust and Intellect and divide by 6. Take that many chicks)",
			"choices": [
				{
					"name": "Alicia Vikander",
					"image": "AliciaVikander.jpg",
					"modifier": "",
					"perk": "",
					"description": ""
				},
				{
					"name": "Keira Knightly",
					"image": "KeiraKnightly.jpg",
					"modifier": "",
					"perk": "",
					"description": ""
				},
				{
					"name": "Eva Green",
					"image": "EvaGreen.jpg",
					"modifier": "",
					"perk": "",
					"description": ""
				},
				{
					"name": "Maggie Geha",
					"image": "MaggieGeha.jpg",
					"modifier": "",
					"perk": "",
					"description": ""
				},
				{
					"name": "Ananya Panday",
					"image": "AnanyaPanday.jpg",
					"modifier": "",
					"perk": "",
					"description": ""
				},
				{
					"name": "Yanet Garcia",
					"image": "YanetGarcia.jpg",
					"modifier": "",
					"perk": "",
					"description": ""
				}
			]
		}
	]
}